OpenFOAM-7-master/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $:innerInlet.U;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $:outerInlet.U;
    }

    outlet      { $:outlet.U; }
    staticWalls { $:wall.U; }
    movingWalls { $:movingWall.U; }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
