OpenFOAM-7-master/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $:innerInlet.epsilon;

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $:innerInlet.epsilon;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $:outerInlet.epsilon;
    }

    outlet      { $:outlet.epsilon; }
    staticWalls { $:wall.epsilon; }
    movingWalls { $staticWalls; }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
